app/controllers/chatroom_controller.rb

SELECT "users".* FROM "users"
---
def users
    @users = User.all