app/controllers/messages_controller.rb

    def create
      @message = Message.new(message_params)
      @message.user_id = current_user.id
      if @message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "final test"], ["user_id", 2], ["created_at", "2022-12-25 15:51:07.937646"], ["updated_at", "2022-12-25 15:51:07.937646"]]